function [si_f, I_c] = SI_2019ncov
    I=[291,440,571,830,1287,1975,2744,4515,5974,7711,9692,11791,14380,...
        17205,20438,24324,28018,31161,34546,37198,40171];
    t=1:21;
    N0=100000;
    I0=I(1,1);
    S0=N0-I0;
    a0=S0/I0;
    %si_f=fit(t',I','1400000000/(4810995.56357388*exp(-beta.*x) + 1)');
    %I_c = N./(a.*exp(-beta.*t) + 1);
    si_f=fit(t',I','N/(a*exp(-beta.*x) + 1)','Startpoint', [N0 a0 0.2]);
    t2=1:37;
    I_c = si_f(t2);
    %date = {'Jan_20','Jan_21','Jan_22','Jan_23','Jan_24','Jan_25',...
    %     'Jan_26','Jan_27','Jan_28','Jan_29','Jan_30','Jan_31','Feb_1',...
    %     'Feb_2','Feb_3','Feb_4','Feb_5','Feb_6','Feb_7','Feb_8',...
    %     'Feb_9','Feb_10','Feb_11','Feb_12','Feb_13','Feb_14','Feb_15',...
    %     'Feb_16','Feb_17','Feb_18','Feb_19','Feb_20','Feb_21'};
    date = [2020,1,20;2020,1,21;2020,1,22;2020,1,23;2020,1,24;...
        2020,1,25;2020,1,26;2020,1,27;2020,1,28;2020,1,29;2020,1,30;...
        2020,1,31;2020,2,1;2020,2,2;2020,2,3;2020,2,4;2020,2,5;2020,2,6;...
        2020,2,7;2020,2,8;2020,2,9;2020,2,10;2020,2,11;2020,2,12;...
        2020,2,13;2020,2,14;2020,2,15;2020,2,16;2020,2,17;2020,2,18;...
        2020,2,19;2020,2,20;2020,2,21;2020,2,22;2020,2,23;2020,2,24;...
        2020,2,25];
    t_date = datenum(date(1:21,1),date(1:21,2),date(1:21,3),0,0,0);
    t_date2 = datenum(date(1:37,1),date(1:37,2),date(1:37,3),0,0,0);
    figure;
    plot(t_date2, I_c./1000);
    hold on
    plot(t_date, I./1000, '*');
    datetick('x', 6);
    title('确诊病例与时间的增长关系预测')
    xlabel('日期（月/日）')
    ylabel('累计确诊病例/千人')
    legend('预测值','统计值（来源卫健委）')
    %set(gca,'XLim',[737810, 737831]);%X轴的数据显示范围
    %set(gca,'XTick',737810:1:737830);%设置要显示坐标刻度
    %YTL=str2num(get(gca,'yticklabel'));%科学计数法取消
    %YTL1=arrayfun(@(x)sprintf('%d',x*1e9),YTL,'un',0);%科学计数法取消
    %set(gca,'yticklabel',YTL1);%科学计数法取消
    set(gca,'FontSize',8.0,'Fontname', 'Times New Roman');
    %set(gca,'XTickLabel',date{1,1:21});%给坐标加标签 
    %set(gca,'YLim',[0, 100000]);%Y轴的数据显示范围
    
